src/Catalogs/Scan_Изделия/Scan_Изделия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_Изделия</name>
  <attributes>
    <name>DLV</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDExternalSystemProduct</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDПродуктаКП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VIN2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аренда</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаИзделийOFMS</name>
    <type>
      <types>EnumRef.Scan_ГруппыИзделийOFMS</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИстеченияПолиса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействияПолиса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Демо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДемоИТест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДилерНакладнаяУТ</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСКлиентомНакладнаяУТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУстановкиПлановыхЦенПродукта</name>
    <type>
      <types>DocumentRef.Scan_УстановкаПлановыхЦенПродукта</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказНаЗавод</name>
    <type>
      <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
    </type>
  </attributes>
  <attributes>
    <name>Замечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрашиваемоеМестоПередачи</name>
    <type>
      <types>CatalogRef.Scan_Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретИзмененияСкладаПродажи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлиентНакладнаяУТ</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КлиентПродукта</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КлиентСоглашенияОПоставке</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДилера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КрайняяДатаУстраненияНедостатков</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛокальныйСтатусПродукта</name>
    <type>
      <types>CatalogRef.Scan_ЛокальныеСтатусыПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркаПродукта</name>
    <type>
      <types>CatalogRef.Scan_МаркиПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПередачи</name>
    <type>
      <types>CatalogRef.Scan_Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроизводства</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельДвигателяТС</name>
    <type>
      <types>CatalogRef.Scan_МоделиПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельПродукта</name>
    <type>
      <types>CatalogRef.Scan_МоделиПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельПТС</name>
    <type>
      <types>CatalogRef.Scan_МоделиПоПТС</types>
    </type>
  </attributes>
  <attributes>
    <name>Надстр_Поставщик</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОбновлятьЛогистическиеТипыИз1БД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОбновлятьМоделиИз1БД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРазрешеноМенятьСрокУстраненияНедостатков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДвигателяТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИзделия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПолисаОСАГО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЭРАГЛОНАСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортОтправки</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПортПрихода</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродавецПродукта</name>
    <type>
      <types>CatalogRef.Scan_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СебестоимостьЛогистическая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СегментРынкаПродуктов</name>
    <type>
      <types>CatalogRef.Scan_СегментыРынкаПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПродажи</name>
    <type>
      <types>CatalogRef.Scan_Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СоглашениеОПоставке</name>
    <type>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СОП</name>
    <type>
      <types>CatalogRef.Scan_ДоговорыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпецификацияПродукта</name>
    <type>
      <types>CatalogRef.Scan_СпецификацииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокУстраненияНедостатковДоп</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтандартнаяСпецификация</name>
    <type>
      <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПродажиБУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПродажиБУБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПродажиБУСтавкаНДС</name>
    <type>
      <types>CatalogRef.Scan_СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТахографСЗаводаСкания</name>
    <type>
      <types>CatalogRef.Scan_ВидыТахографов</types>
    </type>
  </attributes>
  <attributes>
    <name>Тест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипГИБДД</name>
    <type>
      <types>CatalogRef.Scan_ТипыГИБДД</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКабины</name>
    <type>
      <types>CatalogRef.Scan_ТипыКабинИзделий</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКузова</name>
    <type>
      <types>CatalogRef.Scan_ТипыКузова</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПродукта</name>
    <type>
      <types>CatalogRef.Scan_ТипыПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПродуктаЛогистический</name>
    <type>
      <types>CatalogRef.Scan_ТипыПродуктовЛогистика</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСпецификации</name>
    <type>
      <types>EnumRef.Scan_ТипыСпецификации</types>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТопливаДвигателя</name>
    <type>
      <types>CatalogRef.Scan_ТипыТопливаДвигателейПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТСПоПТС</name>
    <type>
      <types>CatalogRef.Scan_ТипыТСПоПТС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипыМаркетинговые</name>
    <type>
      <types>CatalogRef.Scan_МаркетинговыеТипыПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>УстановленныйТахограф</name>
    <type>
      <types>CatalogRef.Scan_ВидыТахографов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветКабиныПТС</name>
    <type>
      <types>CatalogRef.Scan_ЦветаКабиныПТС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкологическийКласс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭПТС</name>
    <type>
      <types>CatalogRef.Scan_ЭПТС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭраГлонассАктивирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/Scan_КлючевыеДатыПроцессов/Scan_КлючевыеДатыПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_КлючевыеДатыПроцессов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной1ДБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GUIDНакладной1ДБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектКлючевойДаты</name>
    <type>
      <types>EnumRef.Scan_ОбъектыКлючевыхДат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
      <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидКлючевойДаты</name>
    <type>
      <types>EnumRef.Scan_КлючевыеДаты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Scan_Изделия/Forms/ФормаНадстройкиУслуги/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Если Параметры.Свойство("Доступность") Тогда
		Элементы.ГруппаФон.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И НЕ ЗначениеЗаполнено(Объект.IDExternalSystemProduct) Тогда
		// Это новый объект не из 1БД
		Объект.СозданВручную = Истина;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// Обработчик подсистемы запрета редактирования реквизитов объектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	
	ОграничитьДоступностьФормыПриОткрытииИзРабочегоМестаДилера();
	
	Элементы.ФормаСоздатьПродукт.Видимость = ПустаяСтрока(Объект.IDExternalSystemProduct);
	
	Scan_СборСтатистики.ВыполнитьРегистрациюСтатистики("Справочники", "Продукты (scania)", "Открытие формы надстройки/услуги");	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Scan_ВспомогательныеФункцииКлиент.ПроверитьПользователяПортала();
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ТекущийОбъект.ЭтоНовый() Тогда
		ТекущийОбъект.УстановитьНовыйКод();
	КонецЕсли;
		
	Если    ПустаяСтрока(ТекущийОбъект.НомерИзделия) 
		Или ТекущийОбъект.НомерИзделия = "9"
		Тогда
		ТекущийОбъект.НомерИзделия = "9"+ Сред(ТекущийОбъект.Код, 2);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);

	ПродуктВАрхиве = РегистрыСведений.Scan_КлючевыеДатыПроцессов.ЧтениеЗначенияРегистраСведения(Объект.Ссылка,
		Перечисления.Scan_КлючевыеДаты.ПолучитьОбъектКлючевойДатыПоПеречислению(Перечисления.Scan_КлючевыеДаты.ПродуктВАрхиве),
		Перечисления.Scan_КлючевыеДаты.ПродуктВАрхиве,ТекущаяДата());
	Если ЗначениеЗаполнено(ПродуктВАрхиве) Тогда
		Элементы.ГруппаФон.ЦветФона = Новый Цвет(255, 227, 227);
	ИначеЕсли Объект.БУ Тогда
		Элементы.ГруппаФон.ЦветФона = WebЦвета.СветлоЖелтыйЗолотистый;
	Иначе
		Элементы.ГруппаФон.ЦветФона = Новый Цвет(240,240,240);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

//rarus agar 20.02.2021 17230 ++
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ОповеститьОВыборе(Объект.Ссылка);
	
КонецПроцедуры
//rarus agar 20.02.2021 17230 --

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ПередатьПродукт(Команда)
	
	Если Записать() Тогда
		ПередатьПродуктНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипПродуктаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФиксированныеНастройки = Новый НастройкиКомпоновкиДанных;
	
	МассивТиповПродуктов = ПолучитьТипыПродуктовНадстроекИУслуг();
	
	СписокТиповПродуктов = Новый СписокЗначений;
	СписокТиповПродуктов.ЗагрузитьЗначения(МассивТиповПродуктов);
	
	Отбор = ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
	Отбор.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
	Отбор.ПравоеЗначение   = СписокТиповПродуктов;
	Отбор.Использование    = Истина;
	Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФиксированныеНастройки", ФиксированныеНастройки);
	
	ОткрытьФорму("Справочник.Scan_ТипыПродуктов.ФормаВыбора", ПараметрыФормы, Элементы.ТипПродукта);
	
КонецПроцедуры

//rarus agar 14.01.2021 n/a ++
&НаКлиенте
Процедура ТипПродуктаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		МассивТиповПродуктов = ПолучитьТипыПродуктовНадстроекИУслуг();
		Если МассивТиповПродуктов.Найти(ВыбранноеЗначение) = Неопределено Тогда
			СтандартнаяОбработка = Ложь;
			Сообщить(НСтр("ru = 'Выбранный тип не является типом надстройки или услуги - нельзя выбрать в карточку.';
			              |en = 'The selected product type is not a type of a body or a service. Adding prohibited'"));
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
//rarus agar 14.01.2021 n/a --

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОграничитьДоступностьФормыПриОткрытииИзРабочегоМестаДилера()
	
	Если Не Параметры.ФормаОткрытаИзРабочегоМестаДилера Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из Элементы Цикл
		Если (ТипЗнч(Элемент) = Тип("ГруппаФормы") И (Элемент.Вид = ВидГруппыФормы.Страницы ИЛИ Элемент.Вид = ВидГруппыФормы.Страница))
		ИЛИ ТипЗнч(Элемент) = Тип("ДекорацияФормы") ИЛИ Элемент = Элементы.ФормаПеречитать ИЛИ Элемент = Элементы.ГруппаФон Тогда
			Продолжить;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, Элемент.Имя, "Доступность", Ложь);
	КонецЦикла;
	
	КоманднаяПанель.Доступность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипыПродуктовНадстроекИУслуг()
	
	МассивТиповПродуктов = Новый Массив;
	
	МассивТиповПродуктовНадстроек = Справочники.Scan_ТипыПродуктов.ПолучитьТипыПродуктовНадстроекИОборудования();
	Для Каждого ЭлементМассива Из МассивТиповПродуктовНадстроек Цикл
		МассивТиповПродуктов.Добавить(ЭлементМассива);
	КонецЦикла;
	
	МассивТиповПродуктовУслуг = Справочники.Scan_ТипыПродуктов.ПолучитьТипыПродуктовУслуг();
	Для Каждого ЭлементМассива Из МассивТиповПродуктовУслуг Цикл
		МассивТиповПродуктов.Добавить(ЭлементМассива);
	КонецЦикла;
	
	Возврат МассивТиповПродуктов;
	
КонецФункции

&НаСервере
Процедура ПередатьПродуктНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	|	Scan_Изделия.НомерИзделия КАК НомерИзделия,
	|	Scan_Изделия.Наименование КАК Наименование,
	|	Scan_Изделия.МаркаПродукта КАК МаркаПродукта,
	|	Scan_Изделия.ТипПродукта КАК ТипПродукта,
	|	Scan_Изделия.ТипПродукта.ВидПродукта КАК ВидПродукта,
	|	Scan_Изделия.ТипыМаркетинговые КАК ТипМаркетинговый
	|ИЗ
	|	Справочник.Scan_Изделия КАК Scan_Изделия
	|ГДЕ
	|	Scan_Изделия.Ссылка = &Ссылка";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Сообщить(НСтр("ru = 'Ошибка получения данных продукта! Продукт не создан.'; en = 'Failed to get product data! Product not created.'"));
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ПараметрыВызова = Новый Структура;
	ПараметрыВызова.Вставить("НомерИзделия",     Выборка.НомерИзделия);
	ПараметрыВызова.Вставить("Наименование",     Выборка.Наименование);
	ПараметрыВызова.Вставить("МаркаПродукта",    Выборка.МаркаПродукта);
	ПараметрыВызова.Вставить("ТипПродукта",      Выборка.ТипПродукта);
	ПараметрыВызова.Вставить("ВидПродукта",      Выборка.ВидПродукта);
	ПараметрыВызова.Вставить("ТипМаркетинговый", Выборка.ТипМаркетинговый);
	
	ОтветСервиса = Scan_ВебСервисыРазборОтветов.ВызватьМетод_CreateProduct(ПараметрыВызова);
	Если ОтветСервиса = Неопределено Тогда
		Сообщить(НСтр("ru = 'Ошибка передачи продукта! Продукт не создан в 1БД.'; en = 'Failed to create product!'"));
	Иначе
		Объект.IDExternalSystemProduct = ОтветСервиса;
		Попытка
			//??
			//фОбъектИзделия.ДополнительныеСвойства.Вставить("ОтправитьРеквизитыВ1БД", ИСТИНА);
			Записать();
		Исключение
			Сообщить(НСтр("ru = 'Ошибка записи продукта! Продукт не записан.'; en = 'Failed to save product!'"));
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
